Revit 2027 API
FabricationHostedInfo Methods
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost |  Disconnects the part from the host.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBearerCenterline |  Gets the centerline of the bearer. The method is applicable only for bearer hanger.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PlaceOnHost(ElementId, Connector, Double) |  Places the part on the specified host.
PlaceOnHost(ElementId, Connector, Double, Double) |  Places the part on the specified host.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace